// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив,
// в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if ( friends.length >= 3 ) {
    console.log('це великий масив');
} else if ( friends.length > 0 ) {
    console.log('це маленький масив')
} else {
    console.log('це пустий масив');
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше).
//  Перевірити, чи знаходиться перше число між двома іншими.

let a = 44;
let b = 22
let c = 7;
   if ( a < b & b < c || c < b & b < a ) {
    console.log('Среднее между а и с  = в');
} else
   if (b < a & a < c || c < a & a < b) {
    console.log('Среднее между b и с  = a');
} else
    if (a < c & c < b || b < c & c < a) {
        console.log('Среднее между b и a  = c');
    }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

 let result = a + b < 4 ? 'Мало':'Багато';
console.log(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let test = +prompt('Введите число от -100 до 100');
if ( test < 0 &&  test >= -100 ) {
    console.log('отрицательное число');
} else if ( test === 0 ) {
    console.log('ноль');
} else if ( test > 0 && test <= 100 ) {
    console.log('Положительное число');
} else {
    console.log('Данное число не из диапазона');
}


let finish = (test < 0 &&  test >= -100) ? 'отрицательное число':
             (test === 0 ) ? 'ноль':
             (test > 0 && test <= 100 ) ? 'Положительное число':
             'Данное число не из диапазона';
console.log(finish);