document.write(`<div><h4>- створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б</h4></div>`);

let S = function(a, b) {
    return S = a * b;
}
S(5,4);
console.log(S);
document.write(`<div><h3> площа прямокутника = ${S} </h3></div><hr>`);
//--------------------------------------------------------------------------------------------------------------------
document.write(`<div><h4>- створити функцію яка обчислює та повертає площу кола з радіусом r</h4></div>`);

let circle = function(r) {
    return  circle = 3.14*r*r;
}
circle(2);
console.log(circle);
document.write(`<div><h3> площа круга = ${circle}</h3></div><hr>`);
//--------------------------------------------------------------------------------------------------------------------
document.write(`<div><h4>- створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r</h4></div>`);
let cylinder = function (h, r) {
    return cylinder = (2*3.14*r)*(h+r);
}
cylinder(10, 5);
console.log(cylinder);
document.write(`<div><h3> площа циліндра = ${cylinder}</h3></div><hr>`);
//--------------------------------------------------------------------------------------------------------------------
document.write(`<div><h4>- створити функцію яка приймає масив та виводить кожен його елемент</h4></div>`);
array = [1, 5, 7, 3, 'wind', 'november', 17, 'okten', 'school'];
F1 = function () {
    for (let i = 0; i < array.length; i++) {
        let argument = array[i];
        document.write(`<div><h3><li>${argument}</li></h3></div>`);
    }
}
F1();
//--------------------------------------------------------------------------------------------------------------------
document.write(`<hr><div><h4>- створити функцію яка створює параграф з текстом. Текст задати через аргумент</h4></div>`);
function message(worlds) {
    document.write('<div>');
    document.write(`<p>${worlds}</p>`);
    document.write('</div>');
}
message('Hi Viktor');

//--------------------------------------------------------------------------------------------------------------------
document.write(`<hr><div><h4>- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий</h4></div>`);


function message2(worlds) {
    document.write('<ul>');
    document.write(`<li> ${worlds} </li>`);
    document.write('</ul>');
}
message2('Hi Viktor1');
message2('Hi Viktor2');
message2('Hi Viktor3');

//--------------------------------------------------------------------------------------------------------------------
document.write(`<hr><div><h4> - створити функцію яка створює ul з трьома елементами li.<br>
 Текст li задати через аргумент всім однаковий.<br>
 Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл) </h4></div>`);

function message3(worlds, n ) {
    for ( let i = 0; i < n; i++) {
        document.write('<ul>');
        document.write(`<li><h3> ${worlds} </h3></li>`);
        document.write('</ul>');
    }
}
message3('Odessa', 5);

//--------------------------------------------------------------------------------------------------------------------
document.write(`<hr><div><h4>- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список</h4></div>`);

let array2=[ true, false, 14, 83, 44, 91, 72, 'Petr', 'Ira', 37, 'milk', true, 'Vova', 'audi', 'BMW' ];
function createArray() {
    for ( let i = 0; i < array2.length; i++) {
        (createArray = array2[i])
        document.write('<ul>');
        document.write(`<li><h3> ${createArray} </h3></li>`);
        document.write('</ul>');

    }
}
createArray();
//--------------------------------------------------------------------------------------------------------------------
document.write(`<hr><div><h4>- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.
 Для кожного об'єкту окремий блок.</h4></div>`);
function test(id,name,age) {
    document.write(`<div><h3><ul>
                      <li>ID :  ${id}</li>  
                       <li>Name :  ${name}</li>
                       <li>Age:   ${age}</li>
                   </ul></h3></div><hr>`)
}
test(1604, 'Viktor', '37');
let simpsons = [
    {
        name: 'Bart',
        id: 'Simpson',
        age: 10,
        info: 'Бартолом\'ю ДжоДжо «Барт» Сімпсон (англ. Bartholomew JoJo «Bart» Simpson) — один із головних героїв мультиплікаційного серіалу Сімпсони. Барт — найстарша дитина Гомера і Мардж Сімпсон. У нього також є дві молодші сестри — Ліса і Меґґі. Барт є втіленням образу бешкетника та посереднього учня у школі. Разом зі своїм батьком Барт є одним із найвідоміших персонажів у цьому серіалі.',
        photo: 'https://upload.wikimedia.org/wikipedia/uk/a/aa/Bart_simpson.png'
    },
    {
        name: 'Homer',
        id: 'Simpson',
        age: 40,
        info: 'Гомер Джей Сімпсон (англ. Homer Jay Simpson) — один із головних героїв мультсеріалу «Сімпсони». Гомер — грубий і неввічливий батько родини, він має очевидні вади: товстий, лисий і не дуже розумний. Нерідко він поводиться як блазень, абсурдно, егоїстично і нетактовно, але все ж лишається симпатичним.',
        photo: 'http://upload.wikimedia.org/wikipedia/en/0/02/Homer_Simpson_2006.png'
    },
    {
        name: 'Marge',
        id: 'Simpson',
        age: 38,
        info: 'Ма́рджори Жакли́н «Мардж» Си́мпсон (в девичестве Бувье́) (англ. Marjorie Jacqueline «Marge» Simpson) — постоянный персонаж мультипликационного сериала «Симпсоны», её озвучивает Джулия Кавнер. Обычно носит зелёное платье, красные балетки, на шее — ожерелье из искусственного жемчуга и ездит на оранжевом универсале. У неё шикарные синие волосы, которые она обычно собирает в очень высокую причёску. Глаза цвета ореха (19s6e). Основное занятие — домохозяйка, большую часть времени проводит в заботе о доме, детях и Гомере. Образ Мардж копирует стереотип провинциальной американской домохозяйки 50-х годов. Мардж — единственный член семьи, посещающий церковь добровольно. Старается поддерживать нравственность не только своей семьи, но и всего города. Отлично готовит, особенно славятся её свиные отбивные и зефир. Любимое блюдо — лапша с маслом.',
        photo: 'https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png'
    },
    {
        name: 'Lisa',
        id: 'Simpson',
        age: 9,
        info: 'Ли́за Мари́ Си́мпсон (англ. Lisa Marie Simpson) — героиня мультипликационного сериала «Симпсоны». Средний ребёнок в семье, восьмилетняя девочка, выделяющаяся среди остальных Симпсонов прежде всего своим умом и рассудительностью.',
        photo: 'https://upload.wikimedia.org/wikipedia/ru/e/ec/Lisa_Simpson.png'
    },
    {
        name: 'Maggie',
        id: 'Simpson',
        age: 1,
        info: 'Ма́ргарет Эвелин «Мэ́гги» Си́мпсон (англ. Margaret Evelyn “Maggie” Simpson) — персонаж мультсериала «Симпсоны». Впервые появилась на телевидении в шоу Трейси Ульман, в короткометражке Good Night (англ.)русск. 19 апреля 1987 года. Мэгги была придумана и разработана карикатуристом Мэттом Грейнингом, пока он ждал встречи с Джеймсом Л. Бруксом. Названа в честь младшей сестры Грейнинга. После появления в шоу Трейси Ульман, через три года семья Симпсонов получила собственный сериал на телеканале Fox, дебют произошёл 17 декабря 1989 года.',
        photo: 'https://upload.wikimedia.org/wikipedia/ru/9/9d/Maggie_Simpson.png'
    },
];


function out() {
    for (let i = 0; i < simpsons.length; i++) {
        const simpson = simpsons[i];
        document.write(`<div>
                        <h3>ID :  ${simpson.id}</h3><br>
                        <h3>Name - ${simpson.name}<br> Age : ${simpson.age}</h3><br>
                        <img src ="${simpson.photo}" alt="photo">
                        </div><hr>`)
    }
 }

out();